import pytest

@pytest.fixture()
def card_numbers():
    """ список с входящими данными и ожидаемым результатом."""
    return [
             ("2363985678548965", "2363 98** **** 8965"),
             ("2363 9856 7854 8965", "2363 98** **** 8965"),
             ("", "вы ничего не ввели"),
             ("23639856", "номер карты не полный")]



@pytest.fixture()
def account_numbers():
    """ список с входящими данными и ожидаемым результатом."""
    return [
        ("73654108430135874305", "**4305"),
        ("", "вы ничего не ввели"),
        ("7365 4108 4301 3587 4305", "**4305"),
        ("7365410843013587", "номер счета не полный"),
    ]


@pytest.fixture()
def account_card():
    """ список с входящими данными и ожидаемым результатом."""
    return [
        ("Visa Platinum 7000792289606361", "Visa Platinum  7000 79** **** 6361"),
        ("Счет 73654108430135874305", "Счет  **4305"),
        ("Счет 736541084301358743", "номер счета не полный"),
    ]