import pytest


# @pytest.fixture()
def card_numbers():
    """список с входящими данными и ожидаемым результатом."""
    return [
        ("2363985678548965", "2363 98** **** 8965"),
        ("2363 9856 7854 8965", "2363 98** **** 8965"),
        ("", "вы ничего не ввели"),
        ("23639856", "номер карты не полный"),
    ]


# @pytest.fixture()
def account_numbers():
    """список с входящими данными и ожидаемым результатом."""
    return [
        ("73654108430135874305", "**4305"),
        ("", "вы ничего не ввели"),
        ("7365 4108 4301 3587 4305", "**4305"),
        ("7365410843013587", "номер счета не полный"),
    ]


# @pytest.fixture()
def account_card():
    """список с входящими данными и ожидаемым результатом."""
    return [
        ("Visa Platinum 7000792289606361", "Visa Platinum 7000 79** **** 6361"),
        ("Счет 73654108430135874305", "Счет **4305"),
        ("Счет 736541084301358743", "номер счета не полный"),
    ]


# @pytest.fixture()
def get_date_input():
    """список с входящими данными и ожидаемым результатом."""
    return [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),  # Базовый случай
        ("2024-01-01T00:00:00", "01.01.2024"),  # Начало года
        ("2024-12-31T23:59:59", "31.12.2024"),  # Конец года
        ("2024-02-29T12:00:00", "29.02.2024"),  # Високосный год
        ("", "пустой ввод"),  # Пустой ввод
        ("not a date", ".."),
    ]  # Некорректная дата




@pytest.fixture()
def filter_by_state_input():
    """вводные данные: (входной список, state, ожидаемый результат)."""
    return (
        [
            {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
            {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
            {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
            {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
        ],
        "EXECUTED",
        [
            {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
            {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
        ],
    )




@pytest.fixture(
    params=[
        (
            # ВХОД
            [
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
            ],
            # ОЖИДАНИЕ
            [
                {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
                {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
                {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
                {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
            ],
        ),
        # пустой список
        ([], []),
    ],
    ids=["standard_sort_desc", "empty_list"],
)  # даем обозначения тестам для понимания
def sort_by_date_input(request):
    return request.param
